# Adult Pandas

Welcome to the advanced Pandas course! 

- First, we're going to look at aggregating and pivoting our beer sales data. That will mark the end of our long and arduous journey with the beer dataset!
- Moving onto alternative datasets, we'll take a look at indexing and combining datasets. 

## Getting Started

Let's begin with the basics.

In [14]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [15]:
df = pd.read_csv('Beer Sales.csv')

In [16]:
df.head()

         Date    Sales
0  2010-06-01   9150.0
1  2010-06-20  10084.0
2  2010-07-12   9242.0
3  2010-07-28  10361.0
4  2010-08-03   8829.0

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    35 non-null     object
 1   Sales   35 non-null     float64
dtypes: float64(1), object(1)
memory usage: 688.0+ bytes

## Preprocessing

At the end of the last course, our DataFrame contained one column for Sales and was indexed by Date. So let's make sure our DataFrame looks just like that before we proceed with further analysis. 

- First, we convert the Date column from type `object` to `datetime`. 
- Second, we index the DataFrame by Date.

In [18]:
df['Date'] = pd.to_datetime(df['Date'])

In [19]:
df = df.set_index('Date')

In [20]:
df

              Sales
Date
2010-06-01   9150.0
2010-06-20  10084.0
2010-07-12   9242.0
2010-07-28  10361.0
2010-08-03   8829.0
2010-08-16   9253.0
2010-08-29  10713.0
2010-09-02  10689.0
2010-09-19   8884.0
2010-10-05   9155.0
2011-06-01  10369.0
2011-06-20  10299.5
2011-07-12   9628.0
2011-07-28   8735.0
2011-08-03   9840.0
2011-08-16  10246.0
2011-09-02  10240.0
2011-09-19   9914.0
2011-10-05  10288.0
2012-06-01   9445.0
2012-06-20   9088.0
2012-07-12  10169.0
2012-07-28  10412.0
2012-08-03  10065.0
2012-08-16  10262.0
2012-09-02   9625.0
2012-09-19   9412.0
2012-10-05   9840.0
2013-06-01   9293.0
2013-06-20  10124.0
2013-07-12  10215.0
2013-08-03  10312.0
2013-08-16   9719.0
2013-09-02   9370.0
2013-10-05   9976.0

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 35 entries, 2010-06-01 to 2013-10-05
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sales   35 non-null     float64
dtypes: float64(1)
memory usage: 560.0 bytes